const dataSurvey = {
    Survey1: {
      Topic: "विकाससँग सम्बन्धी प्रश्नावलीहरु",
      Subject: "क्षेत्रको समग्र अवस्था",
      questions: [
        {
          id: "q1",
          Question: "तपाईँको विचारमा अहिले यो क्षेत्रको मुख्य समस्या के हो?",
          options: [
            { type: "checkbox", option: "सडक" },
            { type: "checkbox", option: "पानी" },
            { type: "checkbox", option: "विजुली" },
            { type: "checkbox", option: "शिक्षा" },
            { type: "checkbox", option: "सिँचाई" },
            { type: "checkbox", option: "स्वास्थ्य" },
          ],
          answer: "", // String for single select
        },
        {
          id: "q2",
          Question: "पछिल्ला ५ वर्षमा क्षेत्रमा सुधार भयो कि बिग्रियो?",
          options: [
            { type: "checkbox", option: "सडक" },
            { type: "checkbox", option: "सुशासन" },
            { type: "checkbox", option: "विधि" },
            { type: "checkbox", option: "शिक्षा" },
            { type: "checkbox", option: "सामाजिक मेलमिलाप" },
            { type: "checkbox", option: "स्वास्थ्य" },
          ],
          answer: "",
        },
        {
          id: "q3",
          Question: "विकासका कामहरू कत्तिको सन्तोषजनक छन्?",
          options: [
            { type: "checkbox", option: "सन्तोषजनक नभएको" },
            { type: "checkbox", option: "ठिकै" },
            { type: "checkbox", option: "ठिक" },
            { type: "checkbox", option: "उत्तम" },
            { type: "checkbox", option: "उत्कृष्ट" },
          ],
          answer: "",
        },
        {
          id: "q4",
          Question: "स्थानीय सरकार प्रतिनिधि जनताप्रति कत्तिको जवाफदेही छन?",
          options: [
            { type: "checkbox", option: "छन्" },
            { type: "checkbox", option: "छैन" },
            { type: "checkbox", option: "मतलव छैन" },
          ],
          answer: "",
        },
         {
          id: "q5",
          Question: "तपाईँ चुनावमा मतदान गर्नुहुन्छ?",
          options: [
            { type: "checkbox", option: "गर्छु" },
            { type: "checkbox", option: "गर्दिन" },
            { type: "checkbox", option: "मतलव छैन" },
          ],
          answer: "",
        },
        {
          id: "q6",
          Question: "मतदान गर्दा सबैभन्दा महत्वपूर्ण कुरा के हो?",
          options: [
            { type: "checkbox", option: "विकास" },
            { type: "checkbox", option: "रोजगारी" },
            { type: "checkbox", option: "शिक्षा" },
            { type: "checkbox", option: "स्वास्थ्य" },
            { type: "checkbox", option: "सुशासन" },
          ],
          answer: "",
        },
         {
          id: "q7",
          Question: "पार्टी हेरेर मतदान गर्नुहुन्छ कि उम्मेदवार हेरेर ?",
          options: [
            { type: "checkbox", option: "पार्टी" },
            { type: "checkbox", option: "उम्मेदवार " },
            { type: "checkbox", option: "नातागोता" },
            
          ],
          answer: "",
        },
        {
          id: "q8",
          Question: "अघिल्लो चुनावमा कसलाई मतदान गर्नुभएको थियो?",
          options: [
            { type: "checkbox", option: "माओवादी" },
            { type: "checkbox", option: "काँग्रेस" },
            { type: "checkbox", option: "एमाले" },
            { type: "checkbox", option: "राप्रपा" },
            { type: "checkbox", option: "माओवादी र सात दल" },
            
          ],
          answer: "",
        },
        {
          id: "q9",
          Question: "राजनीतिक दल र उम्मेदवारसम्बन्धी?",
          options: [
            { type: "text", option: "तपाईँलाई कुन दल/उम्मेदवार मनपर्छ? किन?" },
            { type: "text", option: "हालका उम्मेदवारमध्ये को सबैभन्दा सक्षम लाग्छ?" },
            { type: "text", option: "उम्मेदवारको छवि कस्तो छ? (इमानदार, अनुभवी, पहुँच भएको आदि)" },
            { type: "text", option: "अघिल्लो सांसदको कामप्रति तपाईँ सन्तुष्ट हुनुहुन्छ?" },
            
            
          ],
          answer: "",
        },
        {
          id: "q10",
          Question: "चुनावी वातावरण?",
          options: [
            { type: "text", option: "यो क्षेत्रमा चुनाव शान्तिपूर्ण हुने सम्भावना कत्तिको छ?" },
            { type: "text", option: "मतदातामाथि कुनै दबाब वा प्रभाव छ?" },
            { type: "text", option: "पैसा, शत्तिफ् वा डर प्रयोग भएको अनुभव छ?" },
            { type: "text", option: "महिला, दलित, अल्पसंख्यक मतदाताले स्वतन्त्र रूपमा मतदान गर्न पाउँछन?" },
            
            
          ],
          answer: "",
        },
        {
          id: "q11",
          Question: "सामाजिक–आर्थिक अवस्था?",
          options: [
            { type: "text", option: "तपाईँको मुख्य पेशा के हो?" },
            { type: "text", option: "रोजगारीको अवस्था कस्तो छ?" },
            { type: "text", option: "युवा विदेश जाने प्रवृत्ति कत्तिको छ?" },
            { type: "text", option: "शिक्षा र स्वास्थ्य सेवाको पहुँच कस्तो छ?" },
            
            
          ],
          answer: "",
        },
         {
          id: "q12",
          Question: "मत परिवर्तन गर्ने कारक?",
          options: [
            { type: "text", option: "उम्मेदवार बदलिँदा तपाईँको मत बदलिन्छ?" },
            { type: "text", option: "घोषणापत्रले तपाईँलाई कत्तिको प्रभाव पार्छ?" },
            { type: "text", option: "सामाजिक सञ्जाल/मिडियाको प्रभाव कत्तिको छ?" },
            { type: "text", option: "परिवार वा समुदायको सुभफवले मतमा असर गर्छ??" },
            
            
          ],
          answer: "",
        },
         {
          id: "q13",
          Question: "अपेक्षा र सुभफव",
          options: [
            { type: "text", option: "नयाँ सांसदबाट तपाईँको मुख्य अपेक्षा के हो?" },
            { type: "text", option: "पहिलो प्राथमिकतामा के काम हुनुपर्छ?" },
            { type: "text", option: "चुनाव प्रणालीमा के सुधार चाहनुहुन्छ?" }
            
            
          ],
          answer: "",
        },
      ],
    },
    Survey2: {
      Topic: "राजनीतिक शल्यक्रियाका प्रश्नहरु",
      Subject: "राजनीतिक विषयहरू", // Added for consistency; adjust if needed
      questions: [
        {
          id: "q1",
          Question: "माओवादी पार्टीको नेतृत्वमा साँढे दशबर्षे सम्म जनयुद्ध भएको थियो भन्ने बारे तपाइँलाई जानकारी छ ?",
          options: [
            { type: "checkbox", option: "छ" },
            { type: "checkbox", option: "छैन" },
          ],
          answer: "",
        },
        {
          id: "q2",
          Question: "आजको संघीय लोकतान्त्रिक गणतन्त्र, धर्मनिरपेक्षता, समानुपातिक समाबेशी प्रतिनिधित्व लगायतका उपलब्धिहरु ल्याउनमा तलका मध्ये कुन पार्टीको मुख्य भुमिका थियो ?",
          options: [
            { type: "checkbox", option: "माओवादी" },
            { type: "checkbox", option: "काँग्रेस" },
            { type: "checkbox", option: "एमाले" },
            { type: "checkbox", option: "राप्रपा" },
            { type: "checkbox", option: "माओवादी र सात दल" },
          ],
          answer: "",
        },
        {
          id: "q3",
          Question: "तपाइँको बिचारमा भरतपुर—माडीको आजको बिकासमा तलको मध्ये कुन चाहीं दलको मुख्य भुमिका रहेको छ ?",
          options: [
            { type: "checkbox", option: "माओवादी" },
            { type: "checkbox", option: "कााग्रेस" },
            { type: "checkbox", option: "रास्वपा" },
            { type: "checkbox", option: "स्वतन्त्र व्यत्तिफ्को" },
        
          ],
          answer: "",
        },
        {
          id: "q4",
          Question: "आगामी निर्वाचनमा तलको मध्ये कुन दलको उमेद्वारलाइ रोज्नु हुन्छ?",
          options: [
            { type: "checkbox", option: "माओवादी" },
            { type: "checkbox", option: "कााग्रेस" },
            { type: "checkbox", option: "एमाले" },
            { type: "checkbox", option: "रास्वपा" },
            { type: "checkbox", option: "स्वतन्त्र व्यक्तिकोएकिकृत समाजवादी" },
            { type: "checkbox", option: "जुनसुकै दलको भएपनि योग्य उमेद्वार रोज्छु" },
            { type: "checkbox", option: "दलभन्दा बाहिरको स्वतन्त्र उमेद्वार रोज्छु" },
          ],
          answer: "",
        },
        {
          id: "q5",
          Question: "यदि तपाइँको पहिलो रोजाइ माओवादी केन्द्र हो भने तलको मध्ये कुन चाहिं कारणले तपाइँलाइ आकर्षण गरेको हो ?",
          options: [
            { type: "checkbox", option: "आजको समग्र परिबर्तनको बाहक माओवादी भएकोले" },
            { type: "checkbox", option: "सरकारमा रहँदा जनपक्षिय काम गरेकोले" },
            { type: "checkbox", option: "माओवादी नेतृत्व पंत्तिफ् तुलनात्मक रुपमा पारदर्शी र इमान्दार भएकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q6",
          Question: "यदि तपाइँ  माओवादी केन्द्रको उमेद्वार रोज्नुहुन्न भने तलको मध्ये कुन चाहिं कारणले गर्दा तपाइँले तिरस्कार गर्नुभएको  हो  ?",
          options: [
            { type: "checkbox", option: "जनयुद्धको त्याग वलिदान बिपरीत आदर्शबाट बिचलित भएकोले" },
            { type: "checkbox", option: "सरकारमा रहँदा जनपक्षिय काम नगरेकोले" },
            { type: "checkbox", option: "माओवादी नेतृत्व पंत्तिफ् भ्रष्ट भएकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q7",
          Question: "तपाइँको पहिलो रोजाइ एमाले हो भने तलको मध्ये कुन चाहिं कारणले तपाइँलाइ आकर्षण गरेको हो  ? ",
          options: [
            { type: "checkbox", option: "सरकारमा रहँदा जनपक्षिय काम गरेकोले" },
            { type: "checkbox", option: "एमाले नेतृत्व पंत्तिफ् अन्य दलको भन्दा तुलनात्मक रुपमा पारदर्शी र इमान्दार भएकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q8",
          Question: "यदि तपाइँ  एमालेको उमेद्वार रोज्नुहुन्न भने तलको मध्ये कुन चाहिं कारणले गर्दा तपाइँले तिरस्कार गर्नुभएको  हो  ? ",
          options: [
            { type: "checkbox", option: "नेतृत्व पंत्तिफ् अन्य दलको भन्दा तुलनात्मक रुपमा भ्रष्ट भएकोले" },
            { type: "checkbox", option: "कार्यदिशा अष्पष्ट भएकोले" },
            { type: "checkbox",   option: "वर्ग पक्षधरता स्पष्ट नभएकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q9",
          Question: "तपाइँको रोजाइ काङग्रेस हो भने तलको मध्ये कुन चाहिं कारणले तपाइलाइ काँग्रेस प्रति आकर्षण पैदा भएको हो ?",
          options: [
            { type: "checkbox", option: "काङग्रेसले आपफ्नो वर्ग पक्षधरता स्पष्ट गरेकोले" },
            { type: "checkbox", option: "आन्तरीक लोकतन्त्रको अभ्यास काँग्रेसमा सहज भएकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q10",
          Question: "तपाइँको रोजाइ काङग्रेस होइन भने तलको मध्ये कुन चाहिं कारणले तपाइलाइ काँग्रेस प्रति बिकर्षण पैदा भएको हो ?",
          options: [
            { type: "checkbox", option: "बिचार राजनीतिमा कम, भाग बण्डामा बढि अन्तरकलह हुनेभएकोले" },
            { type: "checkbox", option: "काँग्रेस श्रमीक हरुको पार्टी नभएकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q11",
          Question: "तपाइँको पहिलो रोजाइ राष्ट्रिय स्वतन्त्र पार्टी हो भने तलको मध्ये कुन चाहिं कारणले तपाइँलाइ आकर्षण गरेको हो  ? ",
          options: [
            { type: "checkbox", option: "राष्ट्रिय स्वतन्त्र पार्टीको नेतृत्व पंत्तिफ् अन्य दलको भन्दा तुलनात्मक रुपमा कम भ्रष्ट भएकोले" },
            { type: "checkbox", option: "सरकारमा रहँदा जनपक्षिय काम गरेकोले" },
            { type: "checkbox", option: "नेतृत्व पंत्तिफ्मा युवाहरुको बाहुल्यता रहेकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q12",
          Question: " तपाइँको रोजाइ राष्ट्रिय स्वतन्त्र पार्टी होइन भने तलको मध्ये कुन चाहिं कारणले तपाइँलाइ बिकर्षण गरेको हो ? ",
          options: [
            { type: "checkbox", option: "राष्ट्रिय स्वतन्त्र पार्टीको नेतृत्व पंत्तिफ् पनि भ्रष्ट भएकोले" },
            { type: "checkbox", option: "सरकारमा रहँदा जनपक्षिय काम नगरेकोले" },
            { type: "checkbox", option: "गन्तव्य अष्पष्ट भएकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q13",
          Question: "तपाइँको पहिलो रोजाइ राष्ट्रिय प्रजातन्त्र पार्टी हो भने तलको मध्ये कुन चाहिं कारणले तपाइँलाइ आकर्षण गरेको हो  ? ",
          options: [
            { type: "checkbox", option: "राप्रपाले राजतन्त्र पर्फ्काउछन भन्ने बिश्वास भएकोले" },
            { type: "checkbox", option: "नेतृत्व पंत्तिफ् अन्य दलको भन्दा तुलनात्मक रुपमा पारदर्शी र इमान्दार भएकोले" },
            { type: "checkbox", option: "हिन्दु धर्म सापेक्ष मुलुक बनाउँछन भन्ने बिश्वास भएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q14",
          Question: "तपाइँको रोजाइ राष्ट्रिय प्रजातन्त्र पार्टी होइन भने तलको मध्ये कुन चाहिं कारणले तपाइँलाइ बिकर्षण पैद गरेको हो  ?",
          options: [
            { type: "checkbox", option: "राप्रपाको राजतन्त्र पर्फ्काउने एजेण्डा समय सापेक्ष नभएकोले" },
            { type: "checkbox", option: "नेतृत्व पंत्तिफ् भ्रष्ट भएकोले" },
            { type: "checkbox", option: "राप्रपाको एजेण्डा प्रतिगामी भएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q15",
          Question: "यदि तपाइँको रोजाइ दलहरु मध्येको सापेक्षित योग्य उमेद्वार हो भने तलको मध्ये कुन चाहिं कारणले तपाइँ त्यस्तो निर्णयमा पुग्नु भएको हो ?",
          options: [
            { type: "checkbox", option: "योग्य र दक्ष जनप्रतिनिधि आजको आवश्यत्तफ हो" },
            { type: "checkbox", option: "योग्य उमेद्वार छनौट गर्नु मतदातको कर्तव्य हो" },
            { type: "checkbox", option: "दलले होइन, दलहरु भित्रको योग्य उमेद्वारले मात्र जनताको काम गर्ने ल्याकत राख्दछन " },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q16",
          Question: "यदि तपाइँलाइ कुनै पनि राजनीतिक पार्टीहरु मन पर्दैन भने, तलको मध्ये कुन चाहिं कारणले तपाइँलाइ बिकर्षण पैदा गरेको हो ?",
          options: [
            { type: "checkbox", option: "दलबाट निर्वाचित प्रतिनिधिहरुले दललाइ प्राथमिकता बढि र जनतालाइ कम प्राथमिकता दिने गरेकोले" },
            { type: "checkbox", option: "दलबाट पटक पटक एकै व्यत्तिफ्ले अवसर लिएको र तानाशाही देखिएकोले" },
            { type: "checkbox", option: "सबै दलका अधिकाँश नेतृत्व भ्रष्ट भएकोले" },
            { type: "checkbox", option: "दलहरुको अदुरदर्शीताका कारण युवाहरु पलायन हुनुपरेकोले" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q17",
          Question: "यदि आगामी  निर्वाचनमा तपाइँको रोजाइ स्वतन्त्र उमेद्वार हो भने, तलको मध्ये कुन चाहिं कारणले तपाइँ आकर्षित हुनुभएको हो ?",
          options: [
            { type: "checkbox", option: "कसैको ह्विप नलाग्ने भएकोले स्वतन्त्र जनप्रतिनिधि बढि जनउत्तरदायी हुन पाउँछन" },
            { type: "checkbox", option: "सबै दलहरु जनउत्तरदायी देखिएनन" },
            { type: "checkbox", option: "दलका अधिकाँश भ्रष्ट जनप्रतिनिधि भन्दा नयाँ र स्वतन्त्र जनप्रतिनिधिबाट केहि परिबर्तन हुने अपेक्षा भएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text",   option: "अन्य केहि भए" },
        
          ],
          answer: "",
        },
        {
          id: "q18",
          Question: "गुण र दोषको आधारमा कुल पुर्णाङक १०० मा तल उल्लेखित राजनीतिक दलहरुलाइ त्रफ्मश ः कति कति नम्बर (अङक भार) दिनुहुन्छ ?",
          options: [
            { type: "text", option: "एमाले" },
            { type: "text", option: "माओवादी केन्द्र " },
            { type: "text", option: "कांग्रेस" },
            { type: "text", option: "राप्रपा" },
            { type: "text",   option: "राष्ट्रिय स्वतन्त्र पार्टी" },
            { type: "text",   option: "एकिकृत समाजवादी" },
        
          ],
          answer: "",
        },
        {
          id: "q19",
          Question: "दलहरुको गुण र दोषको आधारमा कुल पुर्णाङक १०० मा तल उल्लेखित चुनाव चिन्हमा नम्बर (अङक भार) दिनुहोस ?",
          options: [
            { type: "text", option: "रुख" },
            { type: "text", option: "गोलाकार भित्रको हँसिया हथौडामा" },
            { type: "text", option: "सुर्य" },
            { type: "text", option: "घण्टी" },
            { type: "text", option: "कलम" },
            { type: "text", option: "हलो" },
            
        
          ],
          answer: "",
        },
        {
          id: "q20",
          Question: "आगामी संघीय संसदको निर्वाचनमा सिन्धुपाल्चोक क्षेत्र नं. १ को संसदमा कुन पार्टीको नेता रोज्नुहुन्छ ? कुनै एकमा चिन्ह लगाउनुहोस ।",
          options: [
            { type: "checkbox", option: "माओवादी केन्द्र" },
            { type: "checkbox", option: "कांग्रेस" },
            { type: "checkbox", option: "एमाले" },
            { type: "checkbox", option: "राष्ट्रिय स्वतन्त्र पार्टी" },
            { type: "checkbox", option: "स्वतन्त्र उमेद्वार" }
            
        
          ],
          answer: "",
        },
        {
          id: "q21",
          Question: "यदि आगामी निर्वाचनमा संसदमा तपाइँको रोजाइ माओवादी केन्द्रको उमेद्वार हो भने, तलको मध्ये कुन कारणले आकर्षित हुनुभएको हो  ?",
          options: [
            { type: "checkbox", option: "माओवादी केन्द्रबाट निर्वाचित बर्तमा मेयरबाट अधिकतम जनपक्षिय काम भएकोले" },
            { type: "checkbox", option: "बिद्यमान मेयरको कामको परिणामबाट माओवादी प्रति जनबिश्वास बढेकोले" },
            { type: "checkbox", option: "अन्य दल भ्रष्ट र अपारदर्शी भएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text", option: "अन्य केहि भए" }
            
        
          ],
          answer: "",
        },
        {
          id: "q22",
          Question: "यदि आगामी निर्वाचनमा संसदमा तपाइँको रोजाइ एमालेको उमेद्वार हो भने, तलको मध्ये कुन कारणले आकर्षित हुनुभएको हो  ?",
          options: [
            { type: "checkbox", option: "बिद्यमान मेयरको कामको परिणामबाट माओवादी प्रति जनबिश्वास घटेकोले" },
            { type: "checkbox", option: "सत्तामा रहँदा एमालले अधिकतम जनपक्षिय काम गर्ने भएकोले" },
            { type: "checkbox", option: "अन्य दल भ्रष्ट र अपारदर्शी भएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text", option: "अन्य केहि भए" }
            
        
          ],
          answer: "",
        },
        {
          id: "q23",
          Question: "यदि आगामी निर्वाचनमा संसदमा तपाइँको रोजाइ काङग्रेसको उमेद्वार हो भने, तलको मध्ये कुन कारणले आकर्षित हुनुभएको हो  ?",
          options: [
            { type: "checkbox", option: "सत्तामा रहँदा काङग्रेसले अधिकतम जनपक्षिय काम गर्ने भएकोले" },
            { type: "checkbox", option: "अन्य दल भ्रष्ट र अपारदर्शी भएकोले" },
            { type: "checkbox", option: "बिद्यमान मेयरको कामको परिणामबाट जनता सन्तुष्ट नभएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text", option: "अन्य केहि भए" }
            
        
          ],
          answer: "",
        },
        {
          id: "q24",
          Question: "यदि आगामी निर्वाचनमा संसदमा तपाइँको रोजाइ रास्वपाको उमेद्वार हो भने, तलको मध्ये कुन कारणले आकर्षित हुनुभएको हो  ?",
          options: [
            { type: "checkbox", option: "सत्तामा रहँदा रास्वपा. अधिकतम जनपक्षिय काम गर्ने भएकोले" },
            { type: "checkbox", option: "अन्य दल भ्रष्ट र अपारदर्शी भएकोले" },
            { type: "checkbox", option: "बिद्यमान मेयरको कामको परिणामबाट जनता सन्तुष्ट नभएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text", option: "अन्य केहि भए" }
            
        
          ],
          answer: "",
        },
        {
          id: "q25",
          Question: "आगामी संसदीय चुनावमा सिन्धुपाल्चोक क्षेत्र नं. १ को संसदमा कुन पार्टीबाट निर्वाचित भइदिए हुन्थ्यो जस्तो लाग्छ ? कुनै एकमा चिन्ह लगाउनुहोस ।",
          options: [
            { type: "checkbox", option: "एमाले" },
            { type: "checkbox", option: "माओवादी केन्द्र" },
            { type: "checkbox", option: "कांग्रेस" },
            { type: "checkbox", option: "राष्ट्रिय स्वतन्त्र पार्टी" },
            { type: "checkbox", option: "एकिकृत समाजवादी" },
            { type: "checkbox", option: "राप्रपा" }
            ],
          answer: "",
        },
        {
          id: "q26",
          Question: "यदि संसदमा माओवादी पार्टीबाट निर्वाचित भइदिए हुन्थ्यो जस्तो लाग्छ भने तलको मध्ये कुन चाहिं कारणले तपाइँ माओवादी प्रति आकर्षित हुनुभएको हो ?",
          options: [
            { type: "checkbox", option: "अघिल्लो पटक माओवादीबाट निर्वाचित मेयरबाट माडीमा धेरै बिकास भएकोले" },
            { type: "checkbox", option: "एमालेबाट निर्वाचित हालको मेयरले अपेक्षाकृत बिकास गर्न नसकेकोले" },
            { type: "checkbox", option: "माओवादी जनप्रतिनिधि तुलनात्मकरुपमा पारदर्शी भएकोले" },
            { type: "checkbox", option: "माथिको मध्ये (क) र (ग)" },
            { type: "text", option: "अन्य केहि भए" }
            ],
          answer: "",
        },
        {
          id: "q27",
          Question: "यदि संसदमा अर्कोले पार्टीबाट निर्वाचित भइदिए हुन्थ्यो जस्तो लाग्छ भने तलको मध्ये कुन चाहिं कारणले तपाइँ एमाले प्रति आकर्षित हुनुभएको हो ?",
          options: [
            { type: "checkbox", option: "अघिल्लो पटक माओवादीबाट निर्वाचित मेयरबाट माडीमा धेरै बिकास भएकोले" },
            { type: "checkbox", option: "एमालेबाट निर्वाचित हालको मेयर पारदर्शी देखिएकोले" },
            { type: "checkbox", option: "अन्य दलका जनप्रतिनिधिहरु बढि भ्रष्ट भएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text", option: "अन्य केहि भए" }
            ],
          answer: "",
        },
        {
          id: "q28",
          Question: "यदि मेयरमा काँग्रेस पार्टीबाट निर्वाचित भइदिए हुन्थ्यो जस्तो लाग्छ भने तलको मध्ये कुन चाहिं कारणले तपाइँ  काँग्रेस प्रति आकर्षित हुनुभएको हो ?",
          options: [
            { type: "checkbox", option: "दुइ पफ्रक दलबाट निर्वाचित मेयरको काम सन्तोषजनक नदेखिएकोले" },
            { type: "checkbox", option: "कााग्रेसबाट निर्वाचित जनप्रतिनिधिहरु कम भ्रष्ट हुनेभएकोले" },
            { type: "checkbox", option: "कााग्रेस जनप्रतिनिधि संग काम लिन सहज हुने भएकोले" },
            { type: "checkbox", option: "माथिको सबै" },
            { type: "text", option: "अन्य केहि भए" }
            ],
          answer: "",
        },
        {
          id: "q29",
          Question: "आगामी संघीय प्रतिनिधिसभाको निर्वाचनमा चितवन निर्वाचन क्षेत्र नं. ३ बाट कुन पार्टी निर्वाचित भइदिए हुन्थ्यो जस्तो लाग्छ? कुनै एकमा चिन्ह लगाउनुहोस ।",
          options: [
            { type: "checkbox", option: "माओवादी केन्द्र" },
            { type: "checkbox", option: "कांग्रेस" },
            { type: "checkbox", option: "एमाले" },
            { type: "checkbox", option: "राप्रपा" },
            { type: "checkbox", option: "राष्ट्रिय स्वतन्त्र पार्टी" },
            { type: "checkbox", option: "एकीकृत समाजवादी" },
            ],
          answer: "",
        },
        {
          id: "q30",
          Question: "नेपालको संविधानले निर्धारण गरेको तीन तहको सरकार व्यबहारिक छ ?",
          options: [
            { type: "checkbox", option: "छ " },
            { type: "checkbox", option: "छैन" },
            
            ],
          answer: "",
        },
        {
          id: "q31",
          Question: "यदि व्यबहारीक छैन भने तलको मध्ये कुन चाहिं तह व्यबहारीक छैन जस्तो लाग्छ  ?",
          options: [
            { type: "checkbox", option: "स्थानीय तह" },
            { type: "checkbox", option: "प्रदेश तह" },
            { type: "checkbox", option: "संघीय तह" },
            
            ],
          answer: "",
        },
        {
          id: "q32",
          Question: "सोध्न बाँकी रहेको तर तपाइलाई भन्न मन लागेको केहि भए उल्लेख गर्नुहोस ।",
          options: [
            { type: "text", option: "" },
            
            
            ],
          answer: "",
        },
      ],
    },
  };

export default dataSurvey